#create
a = "hello" #одинарные кавычки
b = 'hello' #двойные кавычки
c = 'I"know" Python' #комбинированые кавычки
d = "I'know' Python" #и так тоже можно
a = 123 #целочисленный тип
a = str(a) #результат123
str([1,1.1,'a']) #реззультат этого
str(True) #результат правды
str(False) #результат лжи
a = "Hello"
print(a)
a[1] #H
a[2] #e
a[3] #l
a[4] #l
a[5] #o
a[-1] #o
a[-2] #l
a[-3] #l
a[-4] #e
a[-5] #H


a = int(input("Введите число:"))
if a %2 ==0:
    print(f"число А явл чётным")
else:
    print(f"число А явл нечётным")