a=1 #целое число
a=1.0 #вещественное число
a=1+1j #комплексное число
a=True #булевое значение
a=None #пустой тип
a="hello" #
a={1, 1.0,"hello"} #множество
a=(1, 1.0,"hello") #кортеж
a=[1, 1.0,"hello"] #список
a= frozenset({1, 1.0,"hello"}) # неизм множество
a={"a":1,"b":2} #словарь
a=b"hello" #байтовый тип
a=byterray(b"hello")
a=[1, 1.0,"hello"] #создаём список
help(a) #выводим инфу об а
print(a) #выводим а
b=input("введи число") #в консоль выводится сообщеник и ожидается когда пользователь введёт число
len(a) #сколько обьектов в а
min(a) #мин а
max(a) #макс а
type(a) #тип обьекта а